Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # docker_container.nginx will be created
+ resource "docker_container" "nginx" {
      + attach           = false
      + bridge           = (known after apply)
      + command          = (known after apply)
      + container_logs   = (known after apply)
      + entrypoint       = (known after apply)
      + env              = (known after apply)
      + exit_code        = (known after apply)
      + gateway          = (known after apply)
      + hostname         = (known after apply)
      + id               = (known after apply)
      + image            = (known after apply)
      + init             = (known after apply)
      + ip_address       = (known after apply)
      + ip_prefix_length = (known after apply)
      + ipc_mode         = (known after apply)
      + log_driver       = "json-file"
      + logs             = false
      + must_run         = true
      + name             = "tutorial"
      + network_data     = (known after apply)
      + read_only        = false
      + remove_volumes   = true
      + restart          = "no"
      + rm               = false
      + security_opts    = (known after apply)
      + shm_size         = (known after apply)
      + start            = true
      + stdin_open       = false
      + tty              = false

      + healthcheck {
          + interval     = (known after apply)
          + retries      = (known after apply)
          + start_period = (known after apply)
          + test         = (known after apply)
          + timeout      = (known after apply)
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + ports {
          + external = 8000
          + internal = 80
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # docker_image.nginx will be created
+ resource "docker_image" "nginx" {
      + id           = (known after apply)
      + keep_locally = false
      + latest       = (known after apply)
      + name         = "nginx:latest"
      + output       = (known after apply)
      + repo_digest  = (known after apply)
    }

  # null_resource.example will be created
+ resource "null_resource" "example" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://ITSG005843-MAC.ngrok.io/lock?id=esmondpeh%252Fatlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
<details><summary>Log</summary>
  <p>

```
[DBUG] 4 files were modified in this pull request
[DBUG] got workspace lock
[DBUG] clone directory "/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default" already exists, checking if it's at the right commit
[DBUG] repo is at correct commit "61e9e81844d8d5f4916bb6bd1a091d63f7af4907" so will not re-clone
[INFO] found no atlantis.yaml file
[INFO] filtered modified files to 4 .tf or terragrunt.hcl files: [main.tf outputs.tf providers.tf versions.tf]
[INFO] there are 1 modified project(s) at path(s): .
[INFO] automatically determined that there were 1 projects modified in this pull request: [repofullname=esmondpeh/atlantis-example path=.]
[DBUG] determining config for project at dir: "."
[DBUG] building config based on server-side config
[DBUG] setting apply_requirements: [] from default server config
[DBUG] setting workflow: "default" from default server config
[DBUG] setting allowed_overrides: [] from default server config
[DBUG] setting allow_custom_workflows: false from default server config
[DBUG] setting delete_source_branch_on_merge: false from default server config
[DBUG] Building project command context for plan
[DBUG] did not specify exact version in terraform configuration, found ">= 0.12"
[INFO] acquired lock with id "esmondpeh/atlantis-example/./default"
[DBUG] acquired lock for project
[DBUG] clone directory "/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default" already exists, checking if it's at the right commit
[DBUG] repo is at correct commit "61e9e81844d8d5f4916bb6bd1a091d63f7af4907" so will not re-clone
[INFO] successfully ran "/usr/local/bin/terraform init -input=false -no-color -upgrade" in "/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default"
[INFO] successfully ran "/usr/local/bin/terraform workspace show" in "/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default"
[INFO] successfully ran "/usr/local/bin/terraform plan -input=false -refresh -no-color -out \"/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default/default.tfplan\"" in "/Users/esmond.peh/.atlantis/repos/esmondpeh/atlantis-example/1/default"
```
</p></details>
